Revit 2023 API
GroupTypeId.GreenBuilding Property
 "Green Building Properties"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public static ForgeTypeId GreenBuilding { get; }
Visual Basic
Public Shared ReadOnly Property GreenBuilding As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ GreenBuilding {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace